minuta/app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]

    @client = Client.find(id)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    id = params[:id]

    @client = Client.find(id)

INSERT INTO "clients" ("name_client", "birth_date", "cpf", "phone_client", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name_client", "Victor"], ["birth_date", "09/07"], ["cpf", "4141"], ["phone_client", "42"], ["created_at", "2017-09-24 19:46:31.691696"], ["updated_at", "2017-09-24 19:46:31.691696"]]
---
  def create
    @client = Client.new(client_params)

    if @client.save

UPDATE "clients" SET "name_client" = ?, "birth_date" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name_client", "Makise Kirusu"], ["birth_date", ""], ["updated_at", "2017-09-24 22:10:58.094766"], ["id", 4]]
---
  def update

    if @client.update(client_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 4]]
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy